Revit 2026 API

# CustomExporterExport(IListElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Export(
	IList<ElementId> viewIds
)
```
```vb
Public Sub Export (
	viewIds As IList(Of ElementId)
)
```
```cpp
public:
void Export(
	IList<ElementId^>^ viewIds
)
```
```fsharp
member Export :
        viewIds : IList<ElementId> -> unit
```

#### Parameters

viewIds IListElementId

#### Reference

CustomExporter Class

Export Overload

Autodesk.Revit.DB Namespace